Revit 2024 API
BuiltInFailures.ElectricalFailures.PanelMismatchDistSysWhenCircuitAssigned Property
 The selected circuit was added to panel [Element], but the distribution system for the panel does not match the power connector definition on the panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PanelMismatchDistSysWhenCircuitAssigned { get; }
Visual Basic
Public Shared ReadOnly Property PanelMismatchDistSysWhenCircuitAssigned As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PanelMismatchDistSysWhenCircuitAssigned {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace